tests/test_files/soap/RDFS_testSearch_paginated_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.services.screening.medicaid.gov/">
   <soapenv:Header/>
   <soapenv:Body>
      <impl:search>
         <arg0>
             <criteria>provider</criteria>
             <value>a</value>
             <pageNumber>1</pageNumber>
             <pageSize>3</pageSize>
         </arg0>
      </impl:search>
   </soapenv:Body>
</soapenv:Envelope>
